common/modules/block/traits/BlockTrait.php

SELECT * FROM `nxt_block` WHERE `name`='boolean'
---
    private function renderBlock($content)
    {
        if (preg_match_all('/\{([0-9a-zA-Z_\-]+?)\}/', $content, $matches)) {
            foreach ($matches[1] as $match) {
                if ($block = Block::find()->where(['name' => $match])->one()) {