common/modules/page/controllers/backend/DefaultController.php

    protected function findModel($id)
    {
        if (($model = Page::findOne($id)) !== null) {
---
SELECT * FROM `nxt_page` WHERE `id`='2'