common/modules/products/views/default/index.php

SELECT * FROM `nxt_currency` WHERE `id`=1
---
    $showAll = '';
}

$currencyDef = Currency::findOne(Yii::$app->params['currency_id']);