modules/admin/models/Question.php

SELECT COUNT(*) FROM `nxt_question` WHERE `status`=1
---
    public static function unread()
    {
        return self::find()->where(['status' => self::STATUS_NEW])->count();