modules/admin/models/Review.php

    public static function unread()
    {
        return self::find()->where(['status' => self::STATUS_NEW])->count();
---
SELECT COUNT(*) FROM `nxt_review` WHERE `status`=1