common/modules/page/controllers/frontend/DefaultController.php

SELECT * FROM `nxt_page` WHERE (`status`=1) AND (`id`='1')
UPDATE `nxt_page` SET `click`=`click`+1 WHERE `id`=1
---
    public function actionView($id)
    {
        $post = Page::find()->where(['status' => IActiveStatus::STATUS_ACTIVE, 'id' => $id])->one();
        if ($post === null) {
            throw new NotFoundHttpException(Yii::t('yii', 'Page not found.'));
        }

        $post->updateCounters(['click' => 1]);