common/modules/page/views/backend/default/_form.php

SELECT * FROM `nxt_page_category`
---
                    ]
                ]) ?>
                <?= $form->field($model, 'slug')->textInput(['maxlength' => true]) ?>
                <?= $form->field($model, 'category_id')->dropDownList(ArrayHelper::map(PageCategory::get(0, PageCategory::find()->all()), 'id', 'str_label')) ?>