common/modules/products/models/Brand.php

SELECT * FROM `nxt_brand` WHERE `enabled`=TRUE ORDER BY `position`
---
    public static function getList($enabled)
    {
        return ArrayHelper::map(self::find()->andFilterWhere(['enabled' => $enabled])->orderBy('position')->all(), 'id', 'name');