common/modules/products/models/Complect.php

    public static function getList()
    {
        return ArrayHelper::map(self::find()->orderBy('position')->all(), 'id', 'name');
---
SELECT * FROM `nxt_complect` ORDER BY `position`