common/modules/products/models/Currency.php

    public static function getList($enabled)
    {
        return ArrayHelper::map(self::find()->andFilterWhere(['enabled' => $enabled])->orderBy(['position' => SORT_ASC])->all(), 'id', 'name');
---
SELECT * FROM `nxt_currency` WHERE `enabled`=TRUE ORDER BY `position`