common/modules/products/models/Feature.php

    public static function getObjectList($enabled, array $category_ids)
    {
        return self::find()->joinWith(['categories'])->andFilterWhere(['nxt_feature.enabled' => $enabled])->andFilterWhere(['category_id' => $category_ids])->orderBy('position')->all();
---
SELECT `nxt_feature`.* FROM `nxt_feature` LEFT JOIN `nxt_feature_category` ON `nxt_feature`.`id` = `nxt_feature_category`.`feature_id` LEFT JOIN `nxt_category` ON `nxt_feature_category`.`category_id` = `nxt_category`.`id` WHERE (`nxt_feature`.`enabled`=TRUE) AND (`category_id`='1') ORDER BY `position`