common/modules/products/models/Product.php

SELECT * FROM `nxt_product` ORDER BY `position`
---
    public static function getList($enabled)
    {
        return ArrayHelper::map(self::find()->andFilterWhere(['enabled' => $enabled])->orderBy('position')->all(), 'id', 'name');

SELECT * FROM `nxt_currency` WHERE `id`=1
---
    public function getPriceDef()
    {
        if (empty($this->_currency)) {
            $this->_currency = Currency::findOne(Yii::$app->params['currency_id']);

SELECT * FROM `nxt_currency` WHERE `id`=1
---
    public function getCurrencyDef()
    {
        if (empty($this->_currency)) {
            $this->_currency = Currency::findOne(Yii::$app->params['currency_id']);