common/modules/products/models/Status.php

SELECT * FROM `nxt_status` ORDER BY `position`
---
    public static function getList($enabled)
    {
        return ArrayHelper::map(self::find()->andFilterWhere(['enabled' => $enabled])->orderBy('position')->all(), 'id', 'name');