common/modules/products/models/Unit.php

SELECT * FROM `nxt_unit` WHERE `enabled`=TRUE ORDER BY `position`
---
    public static function getList($enabled)
    {
        return ArrayHelper::map(self::find()->andFilterWhere(['enabled' => $enabled])->orderBy('position')->all(), 'id', 'name');