common/modules/image/controllers/DefaultController.php

SELECT * FROM `nxt_image` WHERE `name`='20-2'
---
    protected function findModel($name)
    {
        if (($model = Image::findOne(['name' => $name])) !== null) {