common/modules/image/helpers/ImageHelper.php

SELECT * FROM `nxt_image` WHERE `id`=52
---
    protected static function findModel($id)
    {
        if (($model = Image::findOne($id)) !== null) {