common/modules/cart/models/Order.php

SELECT COUNT(*) FROM `nxt_order` WHERE `status` IN (1, 5)
---
    public static function unread()
    {
        return self::find()->where(['status' => [self::STATUS_NEW, self::STATUS_AWAITING]])->count();