common/modules/page/models/Page.php

SELECT `enabled`, `nxt_page_image`.`image_id` FROM `nxt_page_image` WHERE `page_id`=2
---
    public function getImageEnabled()
    {
        if ($this->_imageEnabled != null) {
            return $this->_imageEnabled;
        }

        $name = $this->className();
        $prefix = Yii::$app->db->tablePrefix;
        return $this->_imageEnabled = (new \yii\db\Query())
            ->select(['enabled'])
            ->from('nxt_page_image')
            ->where(['page_id' => $this->id])
            ->indexBy('image_id')
            ->column();