common/modules/products/controllers/DefaultController.php

    public function actionUpdate($id)
    {
        /** @var $model Product */
        $model = $this->findModelMulti($id);

        /** @var $modelsVariant Variant[] */
        $modelsVariant = Variant::find()->where(['product_id' => $id])->multilingual()->all();
---
SELECT * FROM `nxt_variant` WHERE `product_id`='13'

    protected function findModelMulti($id)
    {
        if (($model = Product::find()->where(['id' => $id])->multilingual()->one()) !== null) {
---
SELECT * FROM `nxt_product` WHERE `id`='13'